package Less2;

public class myWork2Paragraph3 {
    public static void main(String[] args) {
        System.out.println(positiveOrNegative(10));
    }
/*3. Написать метод, которому в качестве параметра передается целое число.
    Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.*/
    private static boolean positiveOrNegative(int varA) {if (varA > 0) {
        return false;
    } else return true;

    }
}
// след пункт дз лежит в классе myWork2Paragraph4
